app/Controllers/AuthController.php

    public function login()
    {
        $model = new UserModel();
        $email = $this->request->getPost('email');
        $pass = $this->request->getPost('pass');
        $user = $model->where('email', $email)->first();
        $userPassword = $user['password'] ?? '';
        $passMatch = password_verify($pass, $userPassword) || hash_equals((String) $userPassword, (String) $pass);

        if (!$user || !$passMatch) {
            return view('auth/login', [
                'erreur' => 'auth refuser',
            ]);
        }
        if (!password_get_info($userPassword)['algo']) {
            $model->update($user['id'], ['password' => password_hash($pass, PASSWORD_DEFAULT)]);
---
SELECT *
FROM `users`
WHERE `email` = 'lola@gmail.com'
 LIMIT 1
UPDATE `users` SET `password` = '$2y$10$nmRlpFUh.egbcQxglplyI.O35JPOSUNyhET0THpRu56P4kmSlYaVi'
WHERE `users`.`id` IN ('1')

    public function store()
    {
        $model = new UserModel();

        $email = $this->request->getPost('email');

        if ($model->where('email', $email)->first()) {
            return redirect()->back()->withInput()->with('error', 'L\'email que vous avez saisi existe déjà.');
        }

        $data = [
            'nom' => $this->request->getPost('nom'),
            'email' => $email,
            'genre' => $this->request->getPost('genre'),
            'password' => password_hash($this->request->getPost('pass'), PASSWORD_DEFAULT),
            'role_id' => 2,
            'objectif' => $this->request->getPost('objectif') ?? '',
        ];

        if ($model->insert($data)) {
            $userId = $model->getInsertID();
            $user = $model->find($userId);
---
SELECT *
FROM `users`
WHERE `email` = 'Tsoa@gmail.com'
 LIMIT 1
INSERT INTO `users` (`nom`, `email`, `genre`, `password`, `role_id`, `objectif`) VALUES ('Tsoa', 'Tsoa@gmail.com', 'homme', '$2y$10$0AeS9A9enrYngaHM377fLexuhhxKzz0AI1CdRriwj1TWBWeJLqNzm', 2, '')
SELECT *
FROM `users`
WHERE `users`.`id` = 13