app/Controllers/Profile.php

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
SELECT *
FROM `sante`
WHERE `user_id` = '1'
 LIMIT 1
---
    public function index()
    {
        if(!session()->has('user'))
        {
            return redirect()->to('/login');
        }

        $userId = session()->get('user')['id'];

        $userModel = new UserModel();
        $santeModel = new SanteModel();

        $user = $userModel->find($userId);

        $sante = $santeModel
                    ->where('user_id', $userId)
                    ->first();