app/Controllers/ProfileController.php

    public function index()
    {
        // Vérifier que l'utilisateur est connecté
        $user = session()->get('user');
        if (!$user) {
            return redirect()->to('/login');
        }

        // Charger les données de l'utilisateur depuis la BD
        $model = new UserModel();
        $userData = $model->find($user['id']);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'