app/Controllers/SanteController.php

SELECT *
FROM `sante`
WHERE `user_id` = '13'
 LIMIT 1
---
    public function index()
    {
        $user = session()->get('user');
        if (!$user) {
            return redirect()->to('/login');
        }

        $model = new SanteModel();
        $sante = $model->where('user_id', $user['id'])->first();